load-tests/baseline.yml
# baseline.yml — Baseline load test: public + auth endpoints
#
# Covers:
#   GET  /health                  — health probe (no DB)
#   GET  /api/exercises           — exercise list (DB read, large result set)
#   POST /api/auth/login          — authentication (bcrypt + JWT, rate-limited at 10/min)
#
# Phases: warmup → sustained load → ramp-down
# Pass/fail thresholds: p95 < 200 ms, error rate < 1 %
#
# Run: npm run load:baseline

config:
  target: "http://localhost:5000"
  phases:
    - name: "Warmup"
      duration: 30
      arrivalRate: 3
    - name: "Sustained load"
      duration: 60
      arrivalRate: 15
    - name: "Ramp-down"
      duration: 20
      arrivalRate: 3
  defaults:
    headers:
      Content-Type: "application/json"
  ensure:
    p95: 200
    maxErrorRate: 1

scenarios:
  # ── Health probe (heaviest weighting — cheap, no DB) ──────────────────────
  - name: "Health probe"
    weight: 40
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - hasProperty: "status"

  # ── Exercise list (DB read) ───────────────────────────────────────────────
  - name: "List exercises"
    weight: 35
    flow:
      - get:
          url: "/api/exercises"
          expect:
            - statusCode: 200

  # ── Auth login (bcrypt verify + JWT sign) ────────────────────────────────
  # Uses a known seed account — run this test with the server already seeded,
  # or the test account created by workout-flow.yml first.
  - name: "Auth login"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "artillery@loadtest.local"
            password: "Artillery_L0ad_Test!"
          # 200 on success, 401 on bad creds, 429 on rate limit
          # We accept 200 and 401; 429 would inflate error rate and fail the threshold
          expect:
            - statusCode:
                - 200
                - 401